NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
/*
 * kernel_main.c -- the protected-mode (M-mode) side of the system.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * ===========================================================================
 * WHAT THIS IS
 * ===========================================================================
 *
 * An ESP-IDF application split across both privilege modes of the ESP32-P4's
 * RISC-V core:
 *
 *   kernel_main()  runs in M-mode.  It is ESP-IDF and FreeRTOS as usual: it
 *                  owns the console, the scheduler and every CSR.
 *
 *   user_main()    runs in U-mode.  It cannot touch a CSR, cannot call into
 *                  FreeRTOS and cannot reach the console.  Its only way out is
 *                  `ecall`.
 *
 * The two talk over the syscall interface in syscall.h.  Three things are on
 * the console when this runs:
 *
 *   "Kernel x"     once a second, from a FreeRTOS task in M-mode
 *   "User y"       every two seconds, from U-mode via SYS_WRITE
 *   "syscall z"    every three seconds, from U-mode via SYS_PUTS -- the
 *                  kernel prints the message the user handed it
 *
 * ===========================================================================
 * HOW U-MODE IS ENTERED
 * ===========================================================================
 *
 * FreeRTOS has no concept of a user mode, so U-mode is not a task.  It is a
 * coroutine hosted by one: user_host_task() below calls umode_enter(), which
 * mrets to U-mode and returns when the user traps.  Blocking work therefore
 * happens here, in task context, where FreeRTOS APIs are legal -- SYS_DELAY_MS
 * is a real vTaskDelay(), so while U-mode is sleeping the scheduler runs
 * everything else, including the kernel task.
 *
 * Every trap comes back the same way, whatever it was:
 *
 *   ecall        a syscall.  Dispatched below, the result written into the
 *                saved a0, the saved pc stepped past the ecall, and U-mode
 *                resumed.
 *   an interrupt landed in the U-mode window.  ESP-IDF's vector is restored
 *                before umode_enter() returns, so the interrupt is serviced
 *                on the way out; the loop simply resumes U-mode where it was.
 *   a fault      reported with mcause/mtval/pc, and the user context retired.
 *
 * There is a fourth outcome that is not a trap cause at all: the hardware
 * stack guard may have fired during the window, whatever the window ended on.
 * user_host_task() checks ctx->sp_fired before it looks at the cause, for the
 * reason given in the next section.
 *
 * ===========================================================================
 * THE HARDWARE STACK GUARD FOLLOWS THE WINDOW
 * ===========================================================================
 *
 * CONFIG_ESP_SYSTEM_HW_STACK_GUARD arms the ESP32-P4's assist_debug SP monitor
 * on the bounds of whichever FreeRTOS task is current.  U-mode runs on its own
 * stack in the arena, nowhere near user_host's stack, so entering the window
 * puts sp out of bounds by construction.
 *
 * Left alone that is fatal, and it is the bug that stopped this ever running:
 * the violation is latched at the sp load in umode_enter, held off by the CLIC
 * threshold for the length of the window, and delivered the instant the return
 * mret restores MIE -- so the kernel panics with a "Stack protection fault"
 * whose reported sp is its own and looks perfectly healthy.
 *
 * umode.S therefore hands the guard OVER rather than standing it down: it
 * parks the host task's bounds, points the monitor at [u_sp_min, u_sp_max] --
 * the arena, set by user_ctx_init() below -- for the duration, and puts the
 * task's bounds back on the way out.  A user that runs its stack off either
 * end of its arena is caught by the same silicon that protects every kernel
 * task, and the trap vector reports it in ctx->sp_fired instead of letting it
 * reach IDF's panic handler.
 *
 * Two consequences land in this file rather than in umode.S:
 *
 *   - user_ctx_init() has to fill in u_sp_min/u_sp_max.  umode_enter() will
 *     happily install whatever is there, including zeros.
 *
 *   - kernel_main() has to un-route the assist_debug source on every core but
 *     DEMO_CORE.  The CLIC threshold umode.S raises masks its own core only,
 *     and the source is shared; see the comment at the call.
 *
 * The check is made before the trap cause because the two are independent: the
 * user overflows its stack at one instruction and reaches the kernel at a
 * later, unrelated one -- very likely an ordinary syscall that has nothing
 * wrong with it.
 *
 * ===========================================================================
 * THE LIMIT OF THE ISOLATION HERE, STATED PLAINLY
 * ===========================================================================
 *
 * The privilege boundary is real: U-mode code that executes a csr instruction,
 * an mret, or anything else reserved to M-mode takes an illegal-instruction
 * trap and lands in the handler below.  The syscall interface is the only way
 * across.
 *
 * The MEMORY boundary is not what a production protected build would have, and
 * that is ESP-IDF's doing rather than a shortcut taken here.  IDF's
 * esp_cpu_configure_region_protection() programs all sixteen PMP entries with
 * the lock bit set, very early, before any application code runs.  PMP lock
 * bits cannot be cleared without Smepmp, which the ESP32-P4 does not implement.
 * The entries are therefore final for the rest of the boot, and two of them
 * matter here:
 *
 *   entry 4  [SOC_IRAM_LOW, _iram_text_end)   R+X, locked
 *   entry 5  [_iram_text_end, SOC_DRAM_HIGH)  R+W, locked
 *
 * A locked entry applies to U-mode as well as M-mode, so those two grants are
 * exactly what let user_main() run at all -- but entry 5 also means U-mode can
 * read and write all of kernel DRAM, not just its own arena.  The kernel
 * therefore validates every pointer that arrives from a syscall against the
 * arena (user_range_ok() below) rather than trusting hardware to have done it,
 * which is good practice regardless, but it is a kernel-side check, not a
 * hardware one.
 *
 * Closing that gap means stopping the entries being locked in the first place,
 * by rebuilding IDF's cpu_region_protect.c with PMP_L defined to zero and
 * re-describing the regions for a kernel/user split.  See README.md.
 *
 * The stack guard described above does not close it either, and should not be
 * mistaken for it: it watches sp, not accesses.  A user that leaves sp alone
 * and writes through a wild pointer is caught by neither, which is what
 * user_range_ok() is for.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

