NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "esp_attr.h"
#include "esp_rom_sys.h"
#include "soc/assist_debug_reg.h"
#include "soc/clic_reg.h"
#include "soc/interrupts.h"
#include "soc/soc.h"
#include "soc/soc_caps.h"

#include "syscall.h"
#include "umode.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* The user application's entire world: its stack grows down from the top and
 * every pointer it hands the kernel has to land inside this.
 */

#define USER_ARENA_SIZE 8192

#define KERNEL_TASK_STACK 3072
#define USER_HOST_STACK 4096
#define KERNEL_TASK_PRIO 5
#define USER_HOST_PRIO 5

/* mtvec is a per-hart CSR and umode_enter() borrows it for the duration of the
 * window, so the host task is pinned.  The kernel task is pinned alongside it
 * only to keep the console output in a predictable order.
 *
 * WHICH core it is pinned to is now free: set this to any core the SoC has and
 * everything that has to follow it does.  umode.S selects the current core's
 * assist_debug block at run time, and the un-route in kernel_main() below
 * covers every core except this one.  What is still required is that the window
 * stay pinned to ONE core for its whole length -- umode_enter() snapshots
 * per-hart CSRs before it masks interrupts, so an unpinned host task could be
 * migrated between the snapshot and the restore.
 */

#define DEMO_CORE 0

#define KERNEL_PERIOD_MS 1000

/* Longest SYS_PUTS message the kernel will copy out of the arena */

#define SYS_PUTS_MAX 128

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* The context umode_enter() runs.  Static rather than on the host task's
 * stack: the trap vector reaches it through mscratch and it must outlive
 * every path through the window.
 */

static umode_ctx_t g_user_ctx;

/* U-mode's memory.  In .bss, so in DRAM, which is the region ESP-IDF's locked
 * PMP entry 5 grants U-mode read+write on.
 */

static uint8_t g_user_arena[USER_ARENA_SIZE] __attribute__((aligned(16)));

static SemaphoreHandle_t g_console_mux;

static volatile bool g_user_running;

/* Counters for the boot-time sanity report */

static uint32_t g_syscall_count;
static uint32_t g_irq_in_user;
static bool g_umode_confirmed;

/* Placed by the linker at the end of IRAM text; the top of the region PMP
 * entry 4 grants U-mode execute on.
 */

extern int _iram_text_end;

/****************************************************************************
 * Layout checks
 *
 * umode.S addresses the context through the UCTX_* macros in umode.h.  If the
 * struct and the macros ever drift, the failure is a wild store in a trap
 * vector; catch it at compile time instead.
 ****************************************************************************/

_Static_assert(offsetof(umode_ctx_t, x) == UCTX_X(0), "umode_ctx_t.x moved");
_Static_assert(offsetof(umode_ctx_t, pc) == UCTX_PC, "umode_ctx_t.pc moved");
_Static_assert(offsetof(umode_ctx_t, mcause) == UCTX_MCAUSE, "umode_ctx_t.mcause moved");
_Static_assert(offsetof(umode_ctx_t, mtval) == UCTX_MTVAL, "umode_ctx_t.mtval moved");
_Static_assert(offsetof(umode_ctx_t, k_sp) == UCTX_K_SP, "umode_ctx_t.k_sp moved");
_Static_assert(offsetof(umode_ctx_t, k_mtvec) == UCTX_K_MTVEC, "umode_ctx_t.k_mtvec moved");
_Static_assert(offsetof(umode_ctx_t, k_mtvt) == UCTX_K_MTVT, "umode_ctx_t.k_mtvt moved");
_Static_assert(offsetof(umode_ctx_t, k_mscratch) == UCTX_K_MSCRATCH, "umode_ctx_t.k_mscratch moved");
_Static_assert(offsetof(umode_ctx_t, k_mstatus) == UCTX_K_MSTATUS, "umode_ctx_t.k_mstatus moved");
_Static_assert(offsetof(umode_ctx_t, k_mintstatus) == UCTX_K_MINTSTATUS, "umode_ctx_t.k_mintstatus moved");
_Static_assert(offsetof(umode_ctx_t, k_thresh) == UCTX_K_THRESH, "umode_ctx_t.k_thresh moved");
_Static_assert(offsetof(umode_ctx_t, k_sp_min) == UCTX_K_SP_MIN, "umode_ctx_t.k_sp_min moved");
_Static_assert(offsetof(umode_ctx_t, k_sp_max) == UCTX_K_SP_MAX, "umode_ctx_t.k_sp_max moved");
_Static_assert(offsetof(umode_ctx_t, u_sp_min) == UCTX_U_SP_MIN, "umode_ctx_t.u_sp_min moved");
_Static_assert(offsetof(umode_ctx_t, u_sp_max) == UCTX_U_SP_MAX, "umode_ctx_t.u_sp_max moved");
_Static_assert(offsetof(umode_ctx_t, sp_fired) == UCTX_SP_FIRED, "umode_ctx_t.sp_fired moved");
_Static_assert(offsetof(umode_ctx_t, sp_pc) == UCTX_SP_PC, "umode_ctx_t.sp_pc moved");
_Static_assert(sizeof(umode_ctx_t) == UCTX_SIZE, "umode_ctx_t size changed");

/* umode.S reads five assist_debug registers with plain loads and stores, and
 * hw_stack_guard.h names only the CORE_0 copies as addresses.  It reaches the
 * current core's copy by adding mhartid * ASSIST_DEBUG_CORE_STRIDE, which is
 * correct only while the per-core blocks are evenly spaced and that spacing is
 * the shift UMODE_CORE_OFF applies.  Neither is something umode.S can check
 * for itself, so check all five here.
 */

#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD

#define ASSIST_DEBUG_CORE_STRIDE (ASSIST_DEBUG_CORE_1_INTR_ENA_REG - ASSIST_DEBUG_CORE_0_INTR_ENA_REG)

_Static_assert(ASSIST_DEBUG_CORE_STRIDE == 0x80, "UMODE_CORE_OFF in umode.S shifts mhartid by 7 to reach "
                                                 "the current core's assist_debug block");

#define UMODE_STRIDE_OK(reg) \
  (ASSIST_DEBUG_CORE_1_##reg - ASSIST_DEBUG_CORE_0_##reg == ASSIST_DEBUG_CORE_STRIDE)

_Static_assert(UMODE_STRIDE_OK(INTR_RAW_REG), "assist_debug INTR_RAW is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(INTR_CLR_REG), "assist_debug INTR_CLR is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(SP_MIN_REG), "assist_debug SP_MIN is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(SP_MAX_REG), "assist_debug SP_MAX is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(SP_PC_REG), "assist_debug SP_PC is not one stride apart per core");

/* The stride only means anything if there is more than one block to stride
 * between; DEMO_CORE is range-checked against the same number below.
 */

