NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
_Static_assert(SOC_CPU_CORES_NUM == 2, "the assist_debug stride arithmetic assumes exactly two cores");

#endif

_Static_assert(DEMO_CORE >= 0 && DEMO_CORE < SOC_CPU_CORES_NUM, "DEMO_CORE is not a core this SoC has");

/* umode.S cannot include soc/clic_reg.h, so it carries its own copy of the
 * CLIC threshold address.  Keep the two honest.
 */

_Static_assert(
    UMODE_CLIC_THRESH_REG == CLIC_INT_THRESH_REG, "UMODE_CLIC_THRESH_REG no longer matches IDF's "
                                                  "CLIC_INT_THRESH_REG");
_Static_assert(UMODE_CLIC_THRESH_MASK == (CLIC_CPU_INT_THRESH_V << CLIC_CPU_INT_THRESH_S), "UMODE_CLIC_THRESH_MASK is not a full CLIC threshold mask");

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: kprintf / kwrite
 *
 * Description:
 *   Console output, serialised.  Two tasks print -- the kernel task and the
 *   host task on the user's behalf -- and without the mutex their lines
 *   interleave mid-word.
 *
 ****************************************************************************/
static void kprintf(const char *fmt, ...)
{
    va_list ap;

    xSemaphoreTake(g_console_mux, portMAX_DELAY);
    va_start(ap, fmt);
    vprintf(fmt, ap);
    va_end(ap);
    fflush(stdout);
    xSemaphoreGive(g_console_mux);
}

static void kwrite(const char *buf, uint32_t len)
{
    xSemaphoreTake(g_console_mux, portMAX_DELAY);
    fwrite(buf, 1, len, stdout);
    fflush(stdout);
    xSemaphoreGive(g_console_mux);
}

/****************************************************************************
 * Name: user_range_ok
 *
 * Description:
 *   Is [addr, addr + len) entirely inside the user arena?
 *
 *   Every pointer that arrives from U-mode goes through here.  On this
 *   configuration IDF's locked PMP entry 5 would let U-mode hand us a pointer
 *   into kernel DRAM and the load would succeed, so this check -- not the
 *   hardware -- is what stops a user pointer being used to read the kernel.
 *
 ****************************************************************************/
static bool user_range_ok(uint32_t addr, uint32_t len)
{
    const uintptr_t lo = (uintptr_t) g_user_arena;
    const uintptr_t hi = lo + sizeof(g_user_arena);

    if (len > sizeof(g_user_arena))
    {
        return false;
    }

    /* addr + len cannot wrap once len is bounded by the arena size and addr is
     * at least lo, but check anyway -- the value came from U-mode.
     */

    if (addr < lo || addr > hi || (addr + len) < addr)
    {
        return false;
    }

    return (addr + len) <= hi;
}

/****************************************************************************
 * Name: user_strlen
 *
 * Description:
 *   Length of a NUL-terminated user string, bounded both by the arena and by
 *   max.  Returns -1 if the string is not terminated inside either.
 *
 ****************************************************************************/
static int user_strlen(uint32_t addr, uint32_t max)
{
    const uintptr_t hi = (uintptr_t) g_user_arena + sizeof(g_user_arena);
    const char *p = (const char *) (uintptr_t) addr;
    uint32_t n;

    if (!user_range_ok(addr, 1))
    {
        return -1;
    }

    for (n = 0; n < max; n++)
    {
        if ((uintptr_t) &p[n] >= hi)
        {
            return -1;
        }

        if (p[n] == '\0')
        {
            return (int) n;
        }
    }

    return -1;
}

/****************************************************************************
 * Name: syscall_dispatch
 *
 * Description:
 *   Service one ecall from U-mode.  Runs in M-mode, in the host task, so
 *   blocking here is legal and is exactly how SYS_DELAY_MS works.
 *
 *   On the normal path this advances the saved pc past the ecall and writes
 *   the result into the saved a0, so umode_enter() resumes the user at the
 *   instruction after the trap with the return value in place.
 *
 * Returned Value:
 *   true to resume U-mode, false to retire the user context.
 *
 ****************************************************************************/
static bool syscall_dispatch(umode_ctx_t *ctx)
{
    const uint32_t nr = ctx->x[17];   /* a7 */
    const uint32_t arg0 = ctx->x[10]; /* a0 */
    const uint32_t arg1 = ctx->x[11]; /* a1 */
    uint32_t ret = 0;

    g_syscall_count++;

    /* The trap arrived as ECALL_U rather than ECALL_M, which is the system's
     * own proof that the caller really was in U-mode.  Say so once.
     */

    if (!g_umode_confirmed)
    {
        g_umode_confirmed = true;
        kprintf(
            "KERNEL: first syscall arrived with mcause=%08lx (ECALL from "
            "U-mode) -- user_main is running unprivileged\n",
            (unsigned long) ctx->mcause);
    }

    switch (nr)
    {
        case SYS_NOP:
            break;

        case SYS_WRITE:

            /* The user's own console output: a counted buffer, emitted verbatim */

            if (!user_range_ok(arg0, arg1))
            {
                kprintf(
                    "KERNEL: SYS_WRITE rejected: buf=%08lx len=%lu outside "
                    "the user arena\n",
                    (unsigned long) arg0, (unsigned long) arg1);
                ret = SYS_ERR_FAULT;
                break;
            }

            kwrite((const char *) (uintptr_t) arg0, arg1);
            ret = arg1;
            break;

        case SYS_PUTS:
            {
                /* The message-passing syscall: U-mode hands the kernel a string and
                 * the kernel prints it.  Copied out of the arena first so that what
                 * is printed cannot change under us.
                 */

                char msg[SYS_PUTS_MAX + 1];
                const char *src;
                int len;
                int i;

                len = user_strlen(arg0, SYS_PUTS_MAX);
                if (len < 0)
                {
                    kprintf(
                        "KERNEL: SYS_PUTS rejected: msg=%08lx is not a "
                        "terminated string in the user arena\n",
                        (unsigned long) arg0);
                    ret = SYS_ERR_FAULT;
                    break;
                }

                src = (const char *) (uintptr_t) arg0;
                for (i = 0; i < len; i++)
                {
                    msg[i] = src[i];
                }

                msg[len] = '\0';

                kprintf("%s\n", msg);
                ret = 0;
            }
            break;

        case SYS_DELAY_MS:

            /* U-mode is parked here, in M-mode, on a real FreeRTOS delay, so the
             * scheduler is free to run the kernel task meanwhile.
             */

            vTaskDelay(pdMS_TO_TICKS(arg0));
            break;

        case SYS_EXIT:
            kprintf("KERNEL: user_main exited, status %lu\n", (unsigned long) arg0);
            return false;

        default:
            kprintf("KERNEL: unknown syscall %lu from pc=%08lx\n", (unsigned long) nr, (unsigned long) ctx->pc);
            ret = SYS_ERR_BADNR;
            break;
    }

