NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
    ctx->pc += 4;     /* step past the ecall */
    ctx->x[10] = ret; /* a0 = return value   */
    return true;
}

/****************************************************************************
 * Name: report_fault
 *
 * Description:
 *   Anything that came back from U-mode which was neither a syscall nor an
 *   interrupt.  In a bigger system this is where a user thread would be
 *   killed; here it stops the context and says why.
 *
 ****************************************************************************/
static void report_fault(const umode_ctx_t *ctx)
{
    const uint32_t code = ctx->mcause & MCAUSE_EXCCODE_MASK;
    const char *what;

    switch (code)
    {
        case EXC_INSN_MISALIGNED:
            what = "instruction misaligned";
            break;
        case EXC_INSN_ACCESS:
            what = "instruction access fault";
            break;
        case EXC_ILLEGAL_INSN:
            what = "illegal instruction";
            break;
        case EXC_BREAKPOINT:
            what = "breakpoint";
            break;
        case EXC_LOAD_MISALIGNED:
            what = "load misaligned";
            break;
        case EXC_LOAD_ACCESS:
            what = "load access fault";
            break;
        case EXC_STORE_MISALIGNED:
            what = "store misaligned";
            break;
        case EXC_STORE_ACCESS:
            what = "store access fault";
            break;
        case EXC_ECALL_M:
            what = "ecall from M-mode";
            break;
        default:
            what = "unexpected trap";
            break;
    }

    kprintf("KERNEL: user fault: %s\n", what);
    kprintf("KERNEL:   mcause=%08lx mtval=%08lx pc=%08lx sp=%08lx ra=%08lx\n", (unsigned long) ctx->mcause, (unsigned long) ctx->mtval, (unsigned long) ctx->pc, (unsigned long) ctx->x[2], (unsigned long) ctx->x[1]);
}

/****************************************************************************
 * Name: report_stack_fault
 *
 * Description:
 *   The hardware stack guard fired on the user's stack during the window.
 *   This is the fault the kernel would otherwise have taken itself, several
 *   instructions later and under its own name; umode.S catches the latch on
 *   the way out so it can be attributed to the code that actually caused it.
 *
 ****************************************************************************/
static void report_stack_fault(const umode_ctx_t *ctx)
{
    kprintf("KERNEL: user fault: stack pointer left the arena\n");
    kprintf("KERNEL:   sp=%08lx allowed=%08lx..%08lx detected at pc=%08lx\n", (unsigned long) ctx->x[2], (unsigned long) ctx->u_sp_min, (unsigned long) ctx->u_sp_max, (unsigned long) ctx->sp_pc);
}

/****************************************************************************
 * Name: user_ctx_init
 *
 * Description:
 *   Build the initial U-mode context: entry point, a 16-byte aligned stack at
 *   the top of the arena, and a return address that turns a user_main() which
 *   returns into a SYS_EXIT rather than a wild branch.
 *
 *   gp and tp are deliberately left at zero here; umode.S does not load them,
 *   so U-mode inherits the kernel's and gp-relative addressing works.
 *
 ****************************************************************************/
static void user_ctx_init(umode_ctx_t *ctx)
{
    uintptr_t stack_top;
    int i;

    for (i = 0; i < 32; i++)
    {
        ctx->x[i] = 0;
    }

    stack_top = (uintptr_t) g_user_arena + sizeof(g_user_arena);
    stack_top &= ~(uintptr_t) 15;

    ctx->x[1] = (uint32_t) (uintptr_t) u_exit_stub; /* ra */
    ctx->x[2] = (uint32_t) stack_top;               /* sp */
    ctx->pc = (uint32_t) (uintptr_t) user_main;
    ctx->mcause = 0;
    ctx->mtval = 0;

    /* The range ESP-IDF's hardware stack guard watches while the window is open.
     * umode.S swaps this in for the host task's bounds on the way down and back
     * out again on the way up, so a user that runs its stack off either end of
     * the arena is caught by the same silicon that protects every kernel task --
     * and is reported as a user fault rather than panicking the kernel.
     */

    ctx->u_sp_min = (uint32_t) (uintptr_t) g_user_arena;
    ctx->u_sp_max = (uint32_t) stack_top;
    ctx->sp_fired = 0;
    ctx->sp_pc = 0;
}

/****************************************************************************
 * Name: kernel_task
 *
 * Description:
 *   The M-mode half of the demonstration: "Kernel x" once a second.  An
 *   entirely ordinary FreeRTOS task -- the point is that it keeps running at
 *   its own cadence while the other task is dropping in and out of U-mode.
 *
 ****************************************************************************/
static void kernel_task(void *arg)
{
    TickType_t last = xTaskGetTickCount();
    uint32_t n = 1;

    (void) arg;

    for (;;)
    {
        kprintf("Kernel %lu\n", (unsigned long) n++);
        vTaskDelayUntil(&last, pdMS_TO_TICKS(KERNEL_PERIOD_MS));
    }
}

/****************************************************************************
 * Name: user_host_task
 *
 * Description:
 *   The U-mode half.  This task is not the user application -- it is the
 *   kernel-side host that runs it.  Each pass through the loop drops to
 *   U-mode, comes back on the next trap, and decides what to do about it.
 *
 ****************************************************************************/
static void user_host_task(void *arg)
{
    (void) arg;

    user_ctx_init(&g_user_ctx);

    kprintf("KERNEL: entering U-mode at pc=%08lx sp=%08lx\n", (unsigned long) g_user_ctx.pc, (unsigned long) g_user_ctx.x[2]);

    g_user_running = true;

    while (g_user_running)
    {
        const uint32_t cause = umode_enter(&g_user_ctx);

        /* Checked before the trap cause, because it is independent of it: the
         * user overflowed its stack at some point in the window and then got
         * here by whatever means -- very likely an ordinary syscall.
         */

        if (g_user_ctx.sp_fired != 0)
        {
            report_stack_fault(&g_user_ctx);
            g_user_running = false;
            continue;
        }

