NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
        if ((cause & MCAUSE_INTERRUPT) != 0)
        {
            /* An interrupt landed inside the U-mode window.  umode.S put
             * ESP-IDF's vector back before returning, so it has already been
             * serviced; pick U-mode up exactly where it was.
             */

            g_irq_in_user++;
            continue;
        }

        if ((cause & MCAUSE_EXCCODE_MASK) == EXC_ECALL_U)
        {
            g_user_running = syscall_dispatch(&g_user_ctx);
            continue;
        }

        report_fault(&g_user_ctx);
        g_user_running = false;
    }

    kprintf(
        "KERNEL: user context retired after %lu syscalls "
        "(%lu interrupts taken in U-mode)\n",
        (unsigned long) g_syscall_count, (unsigned long) g_irq_in_user);

    vTaskDelete(NULL);
}

/****************************************************************************
 * Name: boot_report
 *
 * Description:
 *   What the privilege and memory configuration actually is at the moment the
 *   kernel starts, printed rather than assumed.  If U-mode ever fails with an
 *   instruction access fault, this is the first thing to read.
 *
 ****************************************************************************/
static void boot_report(void)
{
    const uintptr_t iram_end = (uintptr_t) &_iram_text_end;
    const uintptr_t user_pc = (uintptr_t) user_main;
    const uintptr_t arena = (uintptr_t) g_user_arena;

    kprintf("\n");
    kprintf("=== ESP32-P4 protected-mode demo: M-mode kernel, U-mode user ===\n");
    kprintf("KERNEL: mstatus=%08lx mtvec=%08lx mintstatus=%08lx\n", (unsigned long) umode_read_mstatus(), (unsigned long) umode_read_mtvec(), (unsigned long) umode_read_mintstatus());
    kprintf("KERNEL: pmpcfg 0=%08lx 1=%08lx 2=%08lx 3=%08lx\n", (unsigned long) umode_read_pmpcfg(0), (unsigned long) umode_read_pmpcfg(1), (unsigned long) umode_read_pmpcfg(2), (unsigned long) umode_read_pmpcfg(3));
    kprintf(
        "KERNEL: IRAM text ends at %08lx; PMP entry 4 grants U-mode R+X "
        "below it\n",
        (unsigned long) iram_end);
    kprintf("KERNEL: user text  %08lx (%s)\n", (unsigned long) user_pc, (user_pc >= SOC_IRAM_LOW && user_pc < iram_end) ? "inside the U-mode execute grant" : "OUTSIDE the grant -- U-mode will fault on the fetch");
    kprintf("KERNEL: user arena %08lx..%08lx (%u bytes, stack and data)\n", (unsigned long) arena, (unsigned long) (arena + USER_ARENA_SIZE), (unsigned) USER_ARENA_SIZE);
#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD
    kprintf("KERNEL: hardware stack guard follows the window on to that range\n");
    kprintf("KERNEL: the window runs on core %d, and reads that core's assist_debug block\n", DEMO_CORE);
    #if SOC_CPU_CORES_NUM > 1
    kprintf(
        "KERNEL: the other core is un-routed from the shared assist_debug\n"
        "KERNEL:   source, so it no longer reports stack guard faults of its own\n");
    #endif
#else
    kprintf("KERNEL: hardware stack guard is disabled in this build\n");
#endif
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: kernel_main
 *
 * Description:
 *   The protected-mode application.  Brings up the console lock, reports the
 *   privilege configuration, and starts the two tasks.
 *
 ****************************************************************************/
void kernel_main(void)
{
    g_console_mux = xSemaphoreCreateMutex();
    configASSERT(g_console_mux != NULL);

#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD && SOC_CPU_CORES_NUM > 1

    /* Take every core but DEMO_CORE out of the assist_debug interrupt routing.
     *
     * ETS_ASSIST_DEBUG_INTR_SOURCE is ONE source in the interrupt matrix, and
     * esp_hw_stack_guard_init() runs on every core, so each core routes it to
     * its own ETS_ASSIST_DEBUG_INUM.  A violation on DEMO_CORE's monitor is
     * therefore delivered to the other cores as well -- where the CLIC
     * threshold that umode.S raises for the window means nothing.  One of them
     * takes it first, finds no explanation (DEMO_CORE clears the latch on the
     * way out of the window) and panics the whole system with "ASSIST_DEBUG is
     * not triggered BUT interrupt occurred!".  Measured: the other core won
     * that race every time.
     *
     * The peripheral offers no way to separate the two -- on this SoC
     * ASSIST_DEBUG_CORE_n_MONITOR_REG is #defined to
     * ASSIST_DEBUG_CORE_n_INTR_ENA_REG, so the monitor enable and the interrupt
     * enable are the same bits.  Un-routing the source is the only lever, and
     * it is one DEMO_CORE can pull on another core's behalf, because the matrix
     * is global.
     *
     * The cost is stated in the boot report: the other cores no longer report
     * stack guard violations of their own.  They run nothing but ESP-IDF's idle
     * and IPC tasks here.
     *
     * The loop covers whichever cores are not DEMO_CORE, so this follows
     * DEMO_CORE wherever it is set -- as does umode.S, which picks its
     * assist_debug block from mhartid at run time.
     */

    for (int core = 0; core < SOC_CPU_CORES_NUM; core++)
    {
        if (core != DEMO_CORE)
        {
            esp_rom_route_intr_matrix(core, ETS_ASSIST_DEBUG_INTR_SOURCE, ETS_INVALID_INUM);
        }
    }

#endif

    boot_report();

    xTaskCreatePinnedToCore(kernel_task, "kernel", KERNEL_TASK_STACK, NULL, KERNEL_TASK_PRIO, NULL, DEMO_CORE);

    xTaskCreatePinnedToCore(user_host_task, "user_host", USER_HOST_STACK, NULL, USER_HOST_PRIO, NULL, DEMO_CORE);
}

/****************************************************************************
 * Name: app_main
 *
 * Description:
 *   ESP-IDF's entry point.  It has already brought the SoC up and started the
 *   scheduler by the time this runs; the kernel proper is kernel_main().
 *
 ****************************************************************************/
void app_main(void)
{
    kernel_main();
}
